Repository: KeironO/switchboard-plug-useraccounts
Catalog: po/*.po
Languages: el

source: You do not have permission to change this
el: Δεν έχετε τα δικαιώματα για να το αλλάξετε

source: Guest Session
el: Συνεδρία επισκέπτη

source: Log In automatically:
el: Συνδεθείτε αυτόματα:

source: The Guest Session allows someone to use a temporary default account without a password.
el: Η συνεδρία επισκέπτη επιτρέπει σε κάποιον να χρησιμοποιήσει έναν προσωρινό προεπιλεγμένο λογαριασμό χωρίς συνθηματικό.

source: Once they log out, all of their settings and data will be deleted.
el: Μόλις αποσυνδεθούν, όλες οι ρυθμίσεις και τα δεδομένα τους θα διαγραφούν.

source: Undo last user account removal
el: Αναίρεση τελευταίας αφαίρεσης λογαριασμού χρήστη

source: You cannot change this for the currently active user
el: Δεν μπορείτε να πραγματοποιήσετε αυτήν την αλλαγή για τον τρέχοντα ενεργό χρήστη

source: You cannot remove the last administrator's privileges
el: Δεν μπορείτε να αφαιρέσετε τα δικαιώματα του τελευταίου διαχειρηστή

source: Account type:
el: Τύπος λογαριασμού:

source: Standard
el: Τυπικός

source: Administrator
el: Διαχειριστής

source: Language:
el: Γλώσσα:

source: Click to switch to Language & Locale Settings
el: Πατήστε για αλλαγή σε ρυθμίσεις γλώσσας και περιοχής

source: Password:
el: Συνθηματικό:

source: Enable User Account
el: Ενεργοποίηση λογαριασμού χρήστη

source: Disable User Account
el: Απενεργοποίηση λογαριασμού χρήστη

source: None set
el: Μη ορισμένο

source: Create user account
el: Δημιουργία λογαριασμού χρήστη

source: Remove user account and its data
el: Αφαίρεση λογαριασμού χρήστη και των δεδομένων του

source: You cannot remove your own user account
el: Δεν μπορείτε να αφαιρέσετε τον δικό σας λογαριασμό χρήστη

source: My Account
el: Ο λογαριασμός μου

source: Other Accounts
el: Άλλοι λογαριασμοί

source: Enabled
el: Ενεργοποιημένος

source: Disabled
el: Απενεργοποιημένος

source: Remove
el: Αφαίρεση

source: Set from File…
el: Ορισμός από φάκελο...

source: Select an image
el: Επιλέξτε μια εικόνα

source: Cancel
el: Ακύρωση

source: Open
el: Άνοιγμα

source: Images
el: Εικόνες

source: Change Password
el: Αλλαγή συνθηματικού

source: Standard User
el: Τυπικός χρήστης

source: Full Name
el: Ονοματεπώνυμο

source: Username
el: Όνομα χρήστη

source: Can only contain lower case letters, numbers and no spaces
el: Μπορεί μόνο να περιέχει πεζά γράμματα, νούμερα και όχι κενά

source: Set password now
el: Ορίστε συνθηματικό τώρα

source: Set no password for login
el: Να μην οριστεί συνθηματικό για την είσοδο

source: Let user create password on first login
el: Επιτρέψτε στο χρήστη να δημιουργήσει συνθηματικό στην πρώτη είσοδο

source: Create User
el: Δημιουργία χρήστη

source: Username is already taken
el: Το όνομα χρήστη χρησιμοποιείται ήδη

source: Username is not valid
el: Το όνομα χρήστη δεν είναι έγκυρο

source: Current Password
el: Τρέχον συνθηματικό

source: Press to authenticate
el: Πιέστε για επαλήθευση

source: Authentication failed
el: Αποτυχία επαλήθευσης

source: New Password
el: Νέο συνθηματικό

source: Password cannot be empty
el: Το συνθηματικό δε μπορεί να είναι κενό

source: Confirm New Password
el: Επιβεβαίωση νέου συνθηματικού

source: Passwords do not match
el: Τα συνθηματικά δε συμπίπτουν

source: Show passwords
el: Εμφάνιση συνθηματικών

source: Password accepted
el: Το συνθηματικό έγινε δεκτό

source: Weak password strength
el: Ασθενές συνθηματικό

source: Medium password strength
el: Μέτριο συνθηματικό

source: Strong password strength
el: Ισχυρό συνθηματικό

source: Resembles your current password
el: Μοιάζει με το τρέχον συνθηματικό σας

source: New password is too simple
el: Το νέο σας συνθηματικό είναι πολύ απλό

source: New password is a palindrome
el: Το νέο σας συνθηματικό είναι παλίνδρομο

source: Authentication is required to change user data
el: Απαιτείται επαλήθευση για την αλλαγή δεδομένων του χρήστη

source: User Accounts
el: Λογαριασμοί χρηστών

source: Manage account permissions and configure user names, passwords, and photos
el: Διαχειριστείτε δικαιώματα λογαριασμών και ρυθμίστε ονόματα χρηστών, συνθηματικά και φωτογραφίες

source: Password change failed
el: Η αλλαγή συνθηματικού απέτυχε

source: Guest session changes will not take effect until you restart your system
el: Οι αλλαγές στη συνεδρία επισκέπτη δε θα τεθούν σε ισχύ μέχρι να επανεκκινήσετε το σύστημα σας

source: Some settings require administrator rights to be changed
el: Κάποιες ρυθμίσεις απαιτούν δικαιώματα διαχειριστή για να αλλάξουν

source: Change Avatar
el: Αλλαγή εικόνας
